NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/combustion/XiDyMFoam/oscillatingCylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-15                -6                0)
    (-15                -2                0)
    (-15                 2                0)
    (-15                 6                0)
    ( -6                -6                0)
    ( -6                -2                0)
    ( -6                 2                0)
    ( -6                 6                0)
    ( -2.82842712474619 -2.82842712474619 0)
    ( -3.86370330515627 -1.03527618041008 0)
    ( -3.86370330515627  1.03527618041008 0)
    ( -2.82842712474619  2.82842712474619 0)
    (  2.82842712474619 -2.82842712474619 0)
    (  2.82842712474619  2.82842712474619 0)
    (  6                -6                0)
    (  6                 6                0)
    ( 50                -6                0)
    ( 50                 6                0)

    (-15                -6                1)
    (-15                -2                1)
    (-15                 2                1)
    (-15                 6                1)
    ( -6                -6                1)
    ( -6                -2                1)
    ( -6                 2                1)
    ( -6                 6                1)
    ( -2.82842712474619 -2.82842712474619 1)
    ( -3.86370330515627 -1.03527618041008 1)
    ( -3.86370330515627  1.03527618041008 1)
    ( -2.82842712474619  2.82842712474619 1)
    (  2.82842712474619 -2.82842712474619 1)
    (  2.82842712474619  2.82842712474619 1)
    (  6                -6                1)
    (  6                 6                1)
    ( 50                -6                1)
    ( 50                 6                1)
);

blocks
(
    hex ( 0  4  5  1 18 22 23 19) (16  8 1) simpleGrading (1 1 1)
    hex ( 1  5  6  2 19 23 24 20) (16  8 1) simpleGrading (1 1 1)
    hex ( 2  6  7  3 20 24 25 21) (16  8 1) simpleGrading (1 1 1)
    hex ( 4  8  9  5 22 26 27 23) ( 8  8 1) simpleGrading (1 1 1)
    hex ( 5  9 10  6 23 27 28 24) ( 8  8 1) simpleGrading (1 1 1)
    hex ( 6 10 11  7 24 28 29 25) ( 8  8 1) simpleGrading (1 1 1)
    hex ( 4 14 12  8 22 32 30 26) (24  8 1) simpleGrading (1 1 1)
    hex (12 14 15 13 30 32 33 31) ( 8 24 1) simpleGrading (1 1 1)
    hex (11 13 15  7 29 31 33 25) (24  8 1) simpleGrading (1 1 1)
    hex (14 16 17 15 32 34 35 33) (80 24 1) simpleGrading (1 1 1)
);

edges
(
    arc  8  9 origin (0 0 0)
    arc  9 10 origin (0 0 0)
    arc 10 11 origin (0 0 0)
    arc 11 13 origin (0 0 0)
    arc 13 12 origin (0 0 0)
    arc 12  8 origin (0 0 0)

    arc 26 27 origin (0 0 1)
    arc 27 28 origin (0 0 1)
    arc 28 29 origin (0 0 1)
    arc 29 31 origin (0 0 1)
    arc 31 30 origin (0 0 1)
    arc 30 26 origin (0 0 1)
);


defaultPatch
{
    name    frontAndBack;
    type    empty;
}

boundary
(
    inletAir
    {
        type patch;
        faces
        (
            (0 1 19 18)
            (2 3 21 20)
        );
    }
    inletFuel
    {
        type patch;
        faces
        (
            (1 2 20 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (16 17 35 34)
        );
    }
    walls
    {
        type wall;
        faces
        (
            ( 0  4 22 18)
            ( 3  7 25 21)
            ( 4 14 32 22)
            ( 7 15 33 25)
            (14 16 34 32)
            (15 17 35 33)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            ( 8  9 27 26)
            ( 9 10 28 27)
            (10 11 29 28)
            (11 13 31 29)
            (13 12 30 31)
            (12  8 26 30)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
